def vvod(number):
    numbers = {'ноль': 0, 'один': 1, 'два': 2, 'три': 3, 'четыре': 4, 'пять': 5, 'шесть': 6, 'семь': 7, 'восемь': 8,
               'девять': 9, 'одиннадцать': 11, 'двенадцать': 12, 'тринадцать': 13, 'четырнадцать': 14, 'пятнадцать': 15,
               'шестнадцать': 16, 'семнадцать': 17, 'восемнадцать': 18, 'девятнадцать': 19,
               'десять': 10, 'двадцать': 20, 'тридцать': 30, 'сорок': 40, 'пятьдесят': 50, 'шестьдесят': 60,
               'семьдесят': 70, 'восемьдесят': 80, 'девяносто': 90}
    num = 0
    number = number.split(' ')

    for el in number:
        num += numbers[el]
    return num
def trans(k):
    numbers = {0: "ноль", 1: 'один', 2: 'два', 3: 'три', 4: 'четыре', 5: 'пять', 6: 'шесть', 7: 'семь', 8: 'восемь',9: 'девять', 10: 'десять',
            11: 'одиннадцать', 12: 'двенадцать', 13: 'тринадцать', 14: 'четырнадцать', 15: 'пятнадцать',16: 'шестнадцать', 17: 'семнадцать', 18: 'восемнадцать', 19: 'девятнадцать'}
    numbers1 = {0: '', 2: 'двадцать', 3: 'тридцать', 4: 'сорок', 5: 'пятьдесят', 6: 'шестьдесят', 7: 'семьдесят', 8: 'восемьдесят', 9: 'девяносто'}
    numbers2 = {1: 'сто', 2: 'двести', 3: 'триста', 4: 'четыреста', 5: 'пятьсот', 6: 'шестьсот', 7: 'семьсот', 8: 'восемьсот', 9: 'девятьсот'}
    numbers3 = {1: 'тысяча', 2: 'две тысячи', 3: 'три тысячи', 4: 'четыре тысячи', 5: 'пять тысяч', 6: 'шесть тысяч', 7: 'семь тысяч', 8: 'восемь тысяч', 9: 'девять тысяч'}
    if k<20:
        return numbers[k]
    elif 19 < k < 100:
        return ((numbers1[k//10])+" "+(numbers[k%10]))
    elif 100 <= k < 1000:
        return ((numbers2[k//100])+ " "+ (numbers1[(k%100)//10])+" "+(numbers[k%10]))
    elif 999 < k < 9999:
        return numbers3[k//1000] +" "+numbers2[(k%1000)//100]+" "+numbers1[((k%1000)%100)//10]+" "+numbers[k % 10]
trans(2)

def calc ( num1, op, num2 ):
        if op in ['плюс', 'минус', 'делить', 'умножить']:
            if op == 'плюс':
                result = vvod(num1) + vvod(num2)
                print(num1 + ' ' + op + ' ' + num2 + ' ' + 'равно' + ' ' + trans(result))
            elif op == 'минус':
                result = vvod(num1) - vvod(num2)
                print(num1 + ' ' + op + ' ' + num2 + ' ' + 'равно' + ' ' + trans(result))
            elif op == 'умножить':
                result = vvod(num1) * vvod(num2)
                print(num1 + ' ' + op + ' ' + 'на' + ' ' + num2 + ' ' + 'равно' + ' ' + trans(result))
            elif op == 'делить' and num2 == 'ноль':
                print('Невозможно')
            elif op == 'делить' and num2 != 'ноль':
                result = vvod(num1) / vvod(num2)
                print(num1 + ' ' + op + ' ' + 'на' + ' ' + num2 + ' ' + 'равно' + ' ' + trans(result))
        else:
            print('Неверный знак')


try:
    calc(input(), input(), input())
except:
    print("Неверно введено число. Проверь!")
